#include <stdio.h>
int main() 
{
	printf(".\n"); // 1-ая фигура
	printf(".........\n");
	printf(".................\n");
	printf(".........................\n");
	printf(".................................\n");
	printf("\n");

	printf(".................................\n");
	printf(".\t\t\t\t.\n"); // 2-ая фигура
	printf(".\t\t\t\t.\n");
	printf(".\t\t\t\t.\n");
	printf(".\t\t\t\t.\n");
	printf(".................................\n");
	printf("\n");

	printf("\t\t\t\t.\n"); // 3-яя фигура
	printf("\t\t\t.........\n");
	printf("\t\t.................\n");
	printf("\t.........................\n");
	printf(".................................\n");
	printf("\n");
	
	printf(".................................\n"); // 4-ая фигура
	printf(".\t|\t|\t|\t.\n");
	printf(".\t|\t|\t|\t.\n");
	printf(".\t|\t|\t|\t.\n");
	printf(".\t|\t|\t|\t.\n");
	printf(".................................\n");
	return 0;
}